// Задача 1. Дано масив рядків. Вивести ті, у яких є цифри (використати метод test та регулярні вирази).

const arr = ["Горіх", "Горіхи123", "123", "123Горіхи", "Горіхи!@#", "!!!"];
const result = arr.filter((str) => /\d/.test(str));
document.write(result);
// Задача 2. Дано масив рядків. Вивести ті, у яких немає цифр.

const arr2 = ["Горіх", "Горіхи123", "123", "123Горіхи", "Горіхи!@#", "!!!"];
const result2 = arr2.filter((str) => !/\d/.test(str));
document.write("<br>" + result2);

// Задача 3. Дано масив рядків. Вивести ті, у яких є голосні літери.

const arr3 = [
  "Горіх",
  "Грх",
  "123",
  "123Грх",
  "Грх!@#",
  "!!!",
  "виноград",
  "яблуко",
];
const result3 = arr3.filter((str) => /[аеєиіїоуюя]/i.test(str));
document.write("<br>" + result3);
// Задача 4. Дано масив рядків. Вивести ті, у яких немає голосних літер.

const arr4 = [
  "Горіх",
  "Грх",
  "123",
  "123Грх",
  "Грх!@#",
  "!!!",
  "виноград",
  "яблуко",
];

const result4 = arr4.filter((str) => !/[аеєиіїоуюя]/i.test(str));
document.write("<br>" + result4);
// Задача 5. Дано масив рядків. Вивести ті, у яких є або цифра 1 або цифра 3.

const arr5 = [
  "Горіх",
  "Грх",
  "123",
  "123Грх",
  "Грх!@#",
  "!!!",
  "виноград",
  "яблуко",
  "111",
];
const result5 = arr5.filter((str) => /[13]/.test(str));
document.write("<br>" + result5);
// Задача 6. Дано рядок тексту, вивести усі числа, які є у тексті.

const text = "Я сьогодні 11.10.25 зібрала 50 яблук, 20 груш і 300 горіхів.";
const numbers = text.match(/\d+/g);
document.write("<br>" + numbers);

// Задача 7. Дано рядок тексту. Знайти усі знаки пунктуації, які були використано.

const text2 = "Привіт! А скільки ти сьогодні зібрала яблук? 5 чи 10?";
const numbers2 = text2.match(/[.,!?;:-]/g);
document.write("<br>" + numbers2);
// Задача 8. Дано рядок тексту. Вивести усі складові, які розділені розділовими знаками.

const text3 = "Привіт! А скільки ти сьогодні зібрала яблук? 5 чи 10. Дякую!";
const words = text3.split(/[.,!?;:-]\s*/);
document.write("<br>" + words);

// Задача 9. Дано рядок тексту. Перевірити, чи містить він дату у форматі dd.mm.yyyy (dd- день, mm- місяць, yyyy- рік).

const text4 = "Сьогодні 11.10.2025 я зібрала 50 яблук.";
const hasDate = /\b\d{2}\.\d{2}\.\d{4}\b/.test(text4);
document.write("<br>" + hasDate);

// Задача 10. Дано рядок тексту. Підрахувати кількість двоцифрових чисел у рядку.

const numbersText = "У мене є 5 яблук, 12 груш, 300 горіхів і 45 шипшин.";
const twoNumbers = numbersText.match(/\b\d{2}\b/g);
document.write("<br>" + twoNumbers.length);

// Задача 11. Визначити чи може бути рядок тексту номером банківської картки (приклад: «4142-3433-2323-3434» ). Знайти усі такі номери (при цьому символи “-” можуть бути, а можуть і не бути, тобто так «4142343323233434».

const cardText =
  "Мої картки: 4142-3433-2323-3434, 1234567890123456, 1234-5678-9012-345, 1234-5678-9012-34567.";
const cardNumbers = cardText.match(/\b\d{4}-?\d{4}-?\d{4}-?\d{4}\b/g);
document.write("<br>" + cardNumbers);

// Задача 12. Дано адресу сайту. Визначити, чи є він урядовим (містить домен “gov”, але не обов”язково у кінці). Наприклад: “https://company.gov.ua”

const site = "https://company.gov.ua";
const isGov = /gov/.test(site);
document.write("<br>" + isGov);
// Задача 13. Вибрати усі роки між 2020 та 2049 з отриманого повідомлення

const text5 =
  "Це було і буде у 2019, 2020, 2021, 2025, 2030, 2040, 2045, 2050 роках.";
const years = text5.match(/\b20[2-4][0-9]\b/g);
document.write("<br>" + years);
// Задача 14. Дано номер телефону. Перевірити, чи є цей телефон телефоном оператора Киїівстар

const phone = "+380671234567";
const isPhoneKyivstar = /^\+38067\d{7}$/.test(phone);
document.write("<br>" + isPhoneKyivstar);
// Задача 15. Користувач вводить прізвище та ім’я в одному рядку через пробіл.  Замінити пробіл на дефіс.

const name = "Рябова Аліна";
const resultName = name.replace(/\s+/, "-");
document.write("<br>" + resultName);
// Задача 16. Користувач вводить дату у форматі «день.місяць.рік». Отримати рядкове представлення дати у форматі «місяць/рік»
const date = "11.10.2025";
const resultDate = date.replace(/(\d{2})\.(\d{2})\.(\d{4})/, "$2/$3");
document.write("<br>" + resultDate);
