// Задача 6. Дано послідовність цін товарів та назв (у окремих масивах). Вивести на екран ті, які може собі дозволити користувач (кількість грошей задається).

if (confirm("Почати виведення?")) {
  let prices = [1000, 2000, 800, 900, 1500];
  let names = ["Сукня", "Сумочка", "Спідниця", "Штани", "Кросівки"];

  let budget = parseInt(prompt("Введіть ваш бюджет:", "3000"));

  document.write("<h3>Товари, які ви можете собі дозволити:</h3>");
  for (let i = 0; i < prices.length; i++) {
    if (prices[i] <= budget) {
      document.write(`${names[i]} - ${prices[i]} грн<br>`);
    }
  }
}
